АлогистикТест2/src/Documents/алк_РасходнаяНакладная/алк_РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПередачиСобственныеСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыПоАддендумам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>НАХЕРА?</comment>
    <type>
      <types>EnumRef.алк_ВидыДокументаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКонтейнерами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.алк_АналитикаРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаИДКонтейнеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Сток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПакетаГод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоотвАссортиментуЗаказа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контейнеры</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>DocumentRef.алк_ЗагрузкаКонтейнера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеПараметрыПакетов/алк_ДополнительныеПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеПараметрыПакетов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидШпона</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>СлойДревесины</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </resources>
  <resources>
    <name>СортированныйПакет</name>
    <comment>из какого пакета была упаковка</comment>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>УчастокВыпуска</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <resources>
    <name>Досушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.алк_УпаковкаНоменклатуры</types>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
      <types>DocumentRef.алк_РучноеИзменениеПараметровПакета</types>
      <types>DocumentRef.алк_СборкаЗапасов</types>
      <types>DocumentRef.алк_Производство</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Catalogs/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерийныеНомера</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Продан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйМеханизмУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_РасходнаяНакладная/Forms/ФормаПодбораПакетов/Module.bsl
&НаКлиенте
Процедура Подобрать(Команда)
	
	Если Не ЗначениеЗаполнено(Префикс) Тогда 
		Префикс = "ШП"
	КонецЕсли;
	
	ТекстПоиска = Префикс + "-"+Прав(Год,2)+"-" + ФОРМАТ(НомерПоиска,"ЧЦ=6; ЧВН=; ЧГ=0");
	
	Если ЗначениеЗаполнено(Аддендум) Тогда		
		Номер = ПолучитьСерийныйНомер(ТекстПоиска, Аддендум, Склад);		
	Иначе 		
		Номер = ПолучитьСерийныйНомерЗаказ(ТекстПоиска, Склад);		
	КонецЕсли; 

	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Номер) Тогда		
		Сообщить("Пакет не найден!");	
		Возврат;
	КонецЕсли; 
	
	НомерПоиска = "";
	
	ОповеститьОВыборе(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(номер));
	
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСерийныйНомер(ТекстПоиска, Аддендум, Склад)
	
	
	Результат = Справочники.СерийныеНомера.ПустаяСсылка();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НайденныйСН
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование ПОДОБНО &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК Ссылка,
		|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Количество,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)) КАК Порода,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) КАК Сорт,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) КАК Длина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК Ширина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100) КАК Влажность,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК Толщина,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)) КАК Припуск,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)) КАК КатегорияПЭО,
		|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|ПОМЕСТИТЬ ВТ_СН
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ОстаткиЗапасовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100),
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_АддендумыСоставТоваров.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_АддендумыСоставТоваров.Порода КАК Порода,
		|	алк_АддендумыСоставТоваров.Сорт КАК Сорт,
		|	алк_АддендумыСоставТоваров.ШиринаОт КАК ШиринаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ШиринаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ШиринаДо
		|	КОНЕЦ КАК ШиринаДо,
		|	алк_АддендумыСоставТоваров.ТолщинаОт КАК ТолщинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ТолщинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ТолщинаДо
		|	КОНЕЦ КАК ТолщинаДо,
		|	алк_АддендумыСоставТоваров.ДлинаОт КАК ДлинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ДлинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ДлинаДо
		|	КОНЕЦ КАК ДлинаДо,
		|	алк_АддендумыСоставТоваров.ВлажностьОт КАК ВлажностьОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ВлажностьДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ВлажностьДо
		|	КОНЕЦ КАК ВлажностьДо,
		|	алк_АддендумыСоставТоваров.ВариантПрипуска КАК ВариантПрипуска,
		|	алк_АддендумыТовары.КатегорияПЭО КАК КатегорияПЭО,
		|	алк_АддендумыСоставТоваров.Характеристика КАК Характеристика,
		|	алк_АддендумыТовары.Номенклатура
		|ПОМЕСТИТЬ ВТ_СоставАддендума
		|ИЗ
		|	Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|		ПО алк_АддендумыСоставТоваров.Ссылка = алк_АддендумыТовары.Ссылка
		|ГДЕ
		|	алк_АддендумыСоставТоваров.Ссылка = &Аддендум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СН.Ссылка КАК Ссылка,
		|	ВТ_СН.Количество КАК Количество
		|ИЗ
		|	ВТ_СН КАК ВТ_СН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоставАддендума КАК ВТ_СоставАддендума
		|		ПО (ВТ_СН.Порода = ВТ_СоставАддендума.Порода
		|				ИЛИ ВТ_СоставАддендума.Порода = ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)
		|					И ВТ_СН.Сорт = ВТ_СоставАддендума.Сорт
		|				ИЛИ ВТ_СоставАддендума.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
		|					И ВТ_СН.Длина >= ВТ_СоставАддендума.ДлинаОт
		|					И ВТ_СН.Длина <= ВТ_СоставАддендума.ДлинаДо
		|					И ВТ_СН.Ширина >= ВТ_СоставАддендума.ШиринаОт
		|					И ВТ_СН.Ширина <= ВТ_СоставАддендума.ШиринаДо
		|					И ВТ_СН.Влажность >= ВТ_СоставАддендума.ВлажностьОт
		|					И ВТ_СН.Влажность <= ВТ_СоставАддендума.ВлажностьДо
		|					И ВТ_СН.Толщина >= ВТ_СоставАддендума.ТолщинаОт
		|					И ВТ_СН.Толщина <= ВТ_СоставАддендума.ТолщинаДо
		|					И ВТ_СН.Припуск = ВТ_СоставАддендума.ВариантПрипуска
		|				ИЛИ ВТ_СоставАддендума.ВариантПрипуска = ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)
		|				ИЛИ ИСТИНА
		|					И ВТ_СН.КатегорияПЭО = ВТ_СоставАддендума.КатегорияПЭО
		|				ИЛИ ВТ_СоставАддендума.КатегорияПЭО = ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)
		|					И ВТ_СН.Характеристика = ВТ_СоставАддендума.Характеристика
		|				ИЛИ ВТ_СоставАддендума.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					И ВТ_СоставАддендума.Номенклатура = ВТ_СН.Номенклатура)";
	
	Запрос.УстановитьПараметр("Аддендум", Аддендум);
	Запрос.УстановитьПараметр("Наименование", ТекстПоиска);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции 


&НаСервереБезКОнтекста
Функция ПолучитьСерийныйНомерЗаказ(ТекстПоиска, Склад)	
	
	Результат = Справочники.СерийныеНомера.ПустаяСсылка();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НайденныйСН
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование ПОДОБНО &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК Ссылка,
		|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Количество,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)) КАК Порода,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) КАК Сорт,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) КАК Длина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК Ширина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100) КАК Влажность,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК Толщина,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)) КАК Припуск,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)) КАК КатегорияПЭО,
		|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|ПОМЕСТИТЬ ВТ_СН
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ОстаткиЗапасовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100),
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СН.Ссылка КАК Ссылка,
		|	ВТ_СН.Количество КАК Количество
		|ИЗ
		|	ВТ_СН КАК ВТ_СН";
	
	Запрос.УстановитьПараметр("Наименование", ТекстПоиска);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции 




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Аддендум") Тогда 		
		Аддендум = Параметры.Аддендум; 
	КонецЕсли;
	
	Если Параметры.Свойство("Участок") Тогда 
		Если Параметры.Участок.Код = "000000040" Тогда  
			Префикс = "ПМ";
			Элементы.Префикс.Видимость = Истина; 
		ИначеЕсли Параметры.Участок.Код = "000000039" Тогда
			Префикс = "ДГ";
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда 		
		Склад = Параметры.Склад; 		
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда 		
		
		Дата = Параметры.Дата;		
		Год = Формат(Дата, "ДФ=yyyy");
		
	КонецЕсли;  	
	
КонецПроцедуры
